/* 
   Localization.strings
   Jiwok

   Created by reubro R on 10/07/10.
   Copyright 2010 kk. All rights reserved.
 */
 
"WARNING_ENTER_USERNAME" = "Enter username.";
"WARNING_ENTER_PWD" = "Enter password.";
"ERROR_LOGIN_FAILED" = "Login failed.Please retry.";
"QUESTION_EXIT_APP" = "Do you really want to quit Jiwok?";
"ERROR_INTERNET_CONNECTION" = "Internet connection Error.";
"INFO_CHECK_CONNECTION" = "Checking Internet connection.";
"INFO_PREPARE_DOWNLOAD" = "Preparing for music download.";
"INFO_PREPARE_VOCAL_DOWNLOAD" = "Preparing to download vocal pack.";
"INFO_PREPARE_SP_SONGS_DOWNLOAD" = "Preparing to download specific song pack.";
"ERROR_GETTING_VOCALS" = "Error in getting vocals list.";
"ERROR_GETTING_SP_SONGS" = "Error in getting specific songs list.";
"INFO_VOCAL_DOWNLOAD" = "Downloading vocal pack.";
"INFO_SP_SONGS_DOWNLOAD" = "Downloading specificsong pack.";
"INFO_DOWNLOAD_MUSIC" = "Jiwok software is downloading certain files to finalize installation. This \nmay take several minutes. Thank you for your patience.";
"INFO_DISCONNECTED" = "You are now disconnected from server.";
"QUESTION_DISCONNECT" = "Do you want to disconnect from server?";
"INFO_DISCONNECTING" = "Disconnecting... Please wait.";
"INFO_ALREADY_CONNECTED" = "Jiwok is already logged by another user. Please disconnect first to access new connection";
"INFO_ANALYSING_SONGS" = "Jiwok is analysing songs.";
"INFO_CHECKING_FOLDERS" = "Jiwok is checking folders.";
"INFO_CHECKING_FOLDERS_COMPLETE" = "Jiwok has completed checking folders.";
"INFO_ANALYSING_COMPLETE" = "Jiwok completed analysing your music files.You can now use your coach on Jiwok";
"QUESTION_IMPROOVE_ANALYSIS" = "Jiwok has analysed your library and some songs are not identified, do you want improve the service and identify these songs?";

// labels in the UI
"LBL_USERNAME" = "Username:";
"LBL_PASSWORD" = "Password:";

"BTN_CAPTION_GENERATE" = "Generate";
"BTN_CAPTION_REMOVE" = "Remove";

"INFO_GENERATING_MP3" = "Jiwok is generating workout MP3.";
"INFO_GENERATING_MP3_COMPLETE" = "Jiwok has completed workout generation.";
"INFO_GENERATING_MP3_FAILED"="Workout generation failed";
"INFO_GENERATING_MP3_NO_WORKOUTS" ="Jiwok has no workouts in queue";
"WARNING_ENTER_TICKET_NUMBER" = "Enter ticket number.";
"WARNING_WORKOUT_RUNNING" = "The selected workout is in process.You cannot remove it now.";
"QUESTION_REMOVE_WORKOUT" = "Are you sure to remove this workout from queue?";
"WARNING_WORKOUT_RUNNING_NEXT_WROKOUT" = "One workout is in process.Cannot select it now.";
"WARNING_CHECKING_DB_SONGS" = "Jiwok has no songs for generating workout";
"INFO_CANCEL_MP3" = "Jiwok has cancelled workout generation";
"INFO_CANCELLING_MP3" = "Jiwok is cancelling the workout generation";
"QUESTION_CANCEL_WORKOUT" = "Are you sure to cancel this workout generation";
"INFO-FOR_BG_ANALYSING" = "Analysing is in progress. Cannot generate the workout now";
"INFO-FOR_MUSIC_SELECT" = "Jiwok has no songs for genrating workout. Select the songs from your Machine";
"INFO-FOR_PROCESS_VOCALS" = "Processing Vocals";
"INFO-FOR_PROCESS_SPECIFIC_SONGS" = "Processing Specific Songs";
"INFO-FOR_MIX" = "Mixing vocals and background songs";

"REMOVE_FOLDER"="Do you really want to remove this folder?";
"WARNING_ANALYZING_INPROGRESS"="Analyzing In progress.Now you cannot remove folders from list.";


// labels in the Login
"AUTO-START"="Start Automatically";
"RELAUNCH-DETECTION"="Relaunch Music Detection";
"AUTO-DETECT"="Auto Detection";

"AUTO_LOGIN_BUTTON"="Automatically sign me in";
"REMEMBER_ME_BUTTON"="Remember my password";

//LABELS FOR MUSIC
"MUSICAL_SEARCH_TITLE"="Select folders that contains your music files:";
"MY_DOCUMENTS"="My documents";
"MY_ITUNES"="My iTunes";
"SAVE"="Save";
"SELECTED_FOLDERS"="Selected Folders";
"MUSIC_AND_BPM"="Music Detection and BPM analysis";

//LABELS FOR WORKOUT
"WORKOUT_TITLE"="Workout generation";
"WORKOUT_DESCRIPTION"="Currently there is no workout generation in progress. Please  invoke the workout generation from your Jiwok web account";
"WORKOUT_SAVE_LOCATION"="Workout MP3 save location";

//SUPPORT
"GET_TICKETS"="Get Your Ticket from here";
"TYPE_COMMENTS"="Type your comments here";
"SUCCESSFULLY_COMMENTED"="Your comments have been successfully posted";

//INFO POP-UPS
"LOGIN_POPUP"="Checking login credentials.. please wait..";
"LOGOUT_POPUP"="Disconnecting... Please wait.";
"ANALYZING_SONGS_POPUP"="Jiwok is detecting and analyzing your music, it could take a moment…please be patient to get your Jiwok coach.";
"FINISHED_ANALYSIS_POPUP"="Jiwok completed analyzing your music files.You can now use your coach on Jiwok.";
"GENERATION_INPROGRESS_POPUP"="Your workout MP3 generation is in progress.";
"GENERATION_COMPLETED_POPUP"="Your workout is ready";

//AutoUpdate
"INFO_DOWNLOAD_AUTOUPDATE"="Downloading jiwok updates";

//Top Menu
"CLOSE_APP"="Close";
